# InstanceElevationParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..InstanceElevationParam Property
ParameterTypeId Class See Also
---
"Elevation from Level"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId InstanceElevationParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InstanceElevationParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ InstanceElevationParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace